---
title: Shoppingnom!
date: 2018-12-26
categories: week 1
---

# SSAFY Start Camp 챗봇 퀘스트

광주_2_김소연 , https://github.com/soyeone

## 스펙(Specification)

**Shoppingnom!** -> **Simple is best!**
1. 가이드 기능
  + 버튼을 이용하여 Shoppingnom의 기능을 살펴볼 수 있음.
2. 실시간 인기 순위
  + 각 카테고리별 인기 제품의 순위를 10위까지 한눈에 확인 가능 
3. 실시간 인기 제품 목록 및 가격 조회
  + 각 카테고리별 10위까지의 인기 순위와 가격을 한눈에 확인 가능
4. Top 10 제품을 가격순으로 조회
  + 각 카테고리별 top 10 제품을 높은, 낮은 가격순으로 정렬하여 한눈에 확인 가능
5. 각 순위권 상품의 평점 조회
  + 각 순위 상품의 구매만족도를 한눈에 확인 가능
6. 해당 쇼핑몰에서의 검색 기능
  + 검색 키워드를 통해 추천 상품 몇 가지만 검색하여 한눈에 확인 가능

## 회고(Retrospective)

+ 데이터를 크롤링할 때, javascript로 쓰인 페이지들 같은 경우 Celenium을 사용해 크롤링 해와야 했는데 그 경우 크롤링 속도가 느려 답답함이 있었다.
+ 이미지 로드할 때 시간이 너무 오래걸렸다.
+ 순위권 내의 제품 뿐만 아니라 위, 양옆의 추천,광고 제품까지 같은 클래스로 쌓여있어 크롤링해온 데이터를 분류하는데 어려움이 있었다.

## 보완 계획(Feedback)

+ 순위권 제품들의 이미지를 같이 보여주는 기능
+  내부 모든 함수들을 모듈화 
+ 다양한 정렬 필터 기능 (평점순, 구매순)
